index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-06-06 Mon 11:40 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Patrick D. Elliott</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/patrickdelliott.css" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.15.1/dist/katex.min.css" integrity="sha384-R4558gYOUz8mP9YWpZJjofhk+zx0AS11p36HnD2ZKj/6JR5z27gSSULCNHIRReVs" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<nav id="preamble" class="status">
<a class="active" href="/">Home</a>
<a href="/research/papers.html">Papers</a>
<a href="/research/slides-handouts.html">Talks</a>
<a href="/teaching.html">Teaching</a>
<a href="/resources.html">Resources</a>
<!-- <a href="https://blog.patrickdelliott.com">Blog</a> -->
<!-- <a href="https://notes.patrickdelliott.com">Notes</a> -->
</nav>
<main id="content" class="content">
<header>
<h1 class="title">Patrick D. Elliott</h1>
</header>
<section id="outline-container-orgdd1c023" class="outline-2">
<h2 id="orgdd1c023">Links</h2>
<div class="outline-text-2" id="text-orgdd1c023">
<ul class="org-ul">
<li><a href="pdf/vitae.pdf">vitae</a></li>
<li><a href="https://github.com/patrl">github</a></li>
<li><a href="https://twitter.com/patrickdelliott">twitter</a></li>
</ul>
</div>
</section>

<section id="outline-container-org5dc9dc8" class="outline-2">
<h2 id="org5dc9dc8">About me</h2>
<div class="outline-text-2" id="text-org5dc9dc8">
<p>
I'm a formal semanticist, which means that my work involves developing models of how we slot meanings together to determine the information conveyed by a sentence, using tools from logic and computer science. I'm currently <a href="https://linguistics.mit.edu/user/pdell/">a visiting faculty member in the linguistics &amp; philosophy department at MIT</a>. Reach me at <a href="mailto:patrick.d.elliott@gmail.com">patrick.d.elliott@gmail.com</a>.
</p>
</div>
</section>

<section id="outline-container-org6b6ab6a" class="outline-2">
<h2 id="org6b6ab6a">News</h2>
<div class="outline-text-2" id="text-org6b6ab6a">
<ul class="org-ul">
<li>I have a new paper under review for the TLLM 2022 proceedings, entitled <b>Disjunction in a predictive theory of anaphora</b>.</li>
<li>I gave a talk at the MIT LF Reading Group entitled <b>Partee conjunctions and free choice with anaphora</b>. Here is the <a href="https://patrickdelliott.com/pdfs/lfrg2022-handout.pdf">Handout</a>.</li>
<li>I gave talk at the <a href="http://tsinghualogic.net/JRC/?page_id=3591">TLLM 2022 workshop on Dynamics in Logic and Language</a>, Tsinghua University, Beijing entitled <b>Disjunction in a predictive theory of anaphora</b>. Here are the <a href="https://patrickdelliott.com/pdf/tllm-slides.pdf">Slides</a>.</li>
<li>I'm teaching a class on discourse referents at MIT during the Spring semester. Course webpage: <a href="https://patrickdelliott.com/anaphora-seminar/">MIT topics in semantics seminar (spring 2022)</a>.</li>
</ul>
</div>
</section>
</main>
</body>
</html>
